"use client";

import { Accordion, AccordionItem } from "@nextui-org/accordion";

const FAQ_ITEMS = [
  {
    question: "Як довго триває доступ до курсу?",
    answer:
      "Ви отримаєте довічний доступ до курсу, включаючи всі оновлення та додаткові матеріали, які будуть додані в майбутньому.",
  },
  {
    question: "Чи потрібні попередні знання перед початком курсу?",
    answer:
      "Для проходження курсу бажано мати базове розуміння програмування та роботи з кодом, але ми почнемо з основних понять і поступово перейдемо до більш складних тем.",
  },
  {
    question: "Чи можу я отримати відшкодування, якщо курс мені не підійде?",
    answer:
      "Так, ми пропонуємо 14-денну гарантію повернення коштів. Якщо ви вирішите, що курс не відповідає вашим очікуванням, ви можете отримати повне відшкодування протягом перших 14 днів.",
  },
  {
    question: "Чи є у курсі практичні завдання?",
    answer:
      "Так, кожен модуль курсу включає практичні завдання, які допоможуть вам застосувати знання на практиці та покращити ваші навички роботи з кодом.",
  },
  {
    question: "Де і як відбувається навчання?",
    answer:
      "Навчання відбувається онлайн через нашу освітню платформу. Ви матимете можливість вивчати матеріали курсу в зручний для вас час, доступ до яких забезпечений з будь-якого пристрою з інтернет-з'єднанням.",
  },
];
export const FAQ = () => {
  return (
    <section>
      <div className={"container mx-auto px-4 sm:px-6"}>
        <div className={"flex flex-row gap-6 py-24"}>
          <div className={"flex-1"}>
            <h2 className={"h2 text-center"}>FAQ</h2>

            <Accordion>
              {FAQ_ITEMS.map((item) => (
                <AccordionItem
                  key={item.question}
                  aria-label={item.question}
                  title={item.question}
                >
                  {item.answer}
                </AccordionItem>
              ))}
            </Accordion>
          </div>
        </div>
      </div>
    </section>
  );
};
