import Image from "next/image";

import myPhoto from "@/public/png/me.png";

export const Author = () => {
  return (
    <section>
      <div className={"container mx-auto px-4 sm:px-6"}>
        <div className={"flex flex-col gap-6 py-24 md:flex-row"}>
          <Image src={myPhoto} alt={"Maksym Rudnyi"} className={"flex-1"} />
          <div className={"flex flex-1 flex-col gap-4"}>
            <h2 className={"h2"}>Привіт, я Рудний Максим.</h2>
            <p>
              Я тут, щоб змінити ваш підхід до програмування. За свої 11 років у
              front-end розробці, я не просто писав код; я майстрував мистецтво
              створення чистого, ефективного коду, який не тільки працює, але й
              викликає захоплення у кожного, хто його бачить.
            </p>
            <p>
              Не вірите, що програмування може бути мистецтвом? Я переконав
              безліч розробників, покращивши їх код завдяки особистому
              менторству. І тепер я тут, щоб допомогти вам. Як? З допомогою
              потужних інструментів, таких як ESLint, Prettier, і SonarQube, які
              я використовую щодня, щоб перетворювати проблемний код на взірець
              чистоти та ефективності.
            </p>
            <p>
              Цей курс — це кульмінація всього, чому я навчився, перевіреного на
              практиці та готового до того, щоб ви взяли його та почали
              застосовувати негайно у своїх проєктах. Я пропоную вам не просто
              навчальний курс; я пропоную вам перспективу, яка відкриє нові
              можливості для вашої кар'єри. Готові приєднатися?
            </p>
          </div>
        </div>
      </div>
    </section>
  );
};
